{
  "intents": [
    { 
      "tag": "greeting",
      "patterns": [
        "Hi",
        "Hey",
        "How are you",
        "Is anyone there?",
        "Hello",
        "Good day"
      ],
      "responses": [
        "Hey :-)",
        "Hello, thanks for visiting",
        "Hi there, what can I do for you?",
        "Hi there, how can I help?"
      ]
    },
    {
      "tag": "goodbye",
      "patterns": ["Bye", "See you later", "Goodbye"],
      "responses": [
        "See you later, thanks for visiting",
        "Have a nice day",
        "Bye! Come back again soon."
      ]
    },
    {
      "tag": "thanks",
      "patterns": ["Thanks", "Thank you", "That's helpful", "Thank's a lot!"],
      "responses": ["Happy to help!", "Any time!", "My pleasure"]
    },
    {
      "tag": "payments",
      "patterns": [
        "Do you take credit cards?",
        "Do you accept Mastercard?",
        "Can I pay with Paypal?",
        "Are you cash only?"
      ],
      "responses": [
        "We accept VISA, Mastercard and Paypal",
        "We accept most major credit cards, and Paypal"
      ]
    },
    {
      "tag": "delivery",
      "patterns": [
        "can i have lifetime access to my purchased programs?",
        "How long does shipping take?",
        "When do I get my delivery?"
      ],
      "responses": [
        "we will contact you for confirmation",
        "Shipping takes 2-4 days"
      ]
    },
    {
      "tag": "crops",
      "patterns": [
        "What categories of products are available in the marketplace?",
        "What are the different types of products I can find in the marketplace?",
        "Can you tell me about the products categories available in the marketplace?",
        "what can i find in marketplace?"
      ],
      "responses": [
        "There are several categories of products available in the marketplace, including whey protein,bcaa,multivitamins and fat burners.",
        "You can find a wide variety of crops in the marketplace, including whey protein,bcaa,multivitamins and fat burners.",
        "Some of the categories of crops available in the marketplace include whey protein,bcaa,multivitamins and fat burners. You can find many different types of products in each of these categories."
      ]
    },
    {
      "tag": "discounts",
      "patterns": [
        "Are there any discounts available on your app?",
        "Can I get a discount on products purchased through your app's marketplace?",
        "Is there any special pricing for products on your app's marketplace?"
      ],
      "responses": [
        "Yes, our app's marketplace offers various discounts and promotions throughout the year to encourage consumers to buy. Please check our app's marketplace regularly for the latest deals and promotions.",
        "We often offer discounts and promotions on our app's marketplace to encourage consumers to buy. Please check our app's marketplace regularly for the latest deals and promotions.",
        "Our app's marketplace offers various discounts and special pricing throughout the year to encourage consumers to buy. Please check our app's marketplace regularly for the latest deals and promotions."
      ]
    },
    {
      "tag": "farmer_features",
      "patterns": [
        "What services can provide your app?",
        "What tools do you offer on your app?"
      ],
      "responses": [
        "The app has features for clients like having diets,workout programs,disponible articles and recipes ,bmi and tdee calculators for free",
        "As a fit person, you can use our app to stay up-to-date on the latest fitness news and easily access all of our offered services.",
        "We have developed several tools specifically for sport guys on our app, including the ability to have diets,workout programs,disponible articles and recipes ,bmi and tdee calculators for free."
   ] },{
      "tag":"mobileapp",
      "patterns":[
        "Are there mobile version for our app?"
      ],
      "responses":[
        "Not yet but its coming,stay tuned "
      ]
    }
  ]
}

  
